# SQL Practice- Chinook Database

In [1]:
import sqlite3
import pandas as pd

In [2]:
#establish connection to the database
conn = sqlite3.connect('chinook.db')
c = conn.cursor()

In [3]:
sqlite_query = """
SELECT name FROM sqlite_master WHERE type = 'table';
"""
pd.read_sql(sqlite_query, conn)

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

12 different datasets given in Chinook Database

In [4]:
table_names = pd.read_sql(sqlite_query, conn)['name']

In [35]:
#gives the top 5 rows of each table in the database
for i in table_names:
    sqlite_query = """
    SELECT * from {} LIMIT 5;""".format(i)
    print("\n\n\n" + i + "\n")
    print(pd.read_sql(sqlite_query, conn))

albums

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3



sqlite_sequence

          name   seq
0       genres    25
1  media_types     5
2      artists   275
3       albums   347
4       tracks  3503



artists

   ArtistId               Name
0         1              AC/DC
1         2             Accept
2         3          Aerosmith
3         4  Alanis Morissette
4         5    Alice In Chains



customers

   CustomerId  FirstName     LastName  \
0           1       Luís    Gonçalves
1           2     Leonie       Köhler
2           3   François     Tremblay
3           4      Bjørn       Hansen
4           5  František  Wichterlová

                                            Company  \
0  Embraer - Empresa Brasileira de Aeronáutica S.A.
1                                              None
2                                              None
3                                              None
4                                  JetBrains s.r.o.

                           Address                 City State         Country  \
0  Av. Brigadeiro Faria Lima, 2170  São José dos Campos    SP          Brazil
1          Theodor-Heuss-Straße 34            Stuttgart  None         Germany
2                1498 rue Bélanger             Montréal    QC          Canada
3                 Ullevålsveien 14                 Oslo  None          Norway
4                    Klanova 9/506               Prague  None  Czech Republic

  PostalCode               Phone                 Fax  \
0  12227-000  +55 (12) 3923-5555  +55 (12) 3923-5566
1      70174    +49 0711 2842222                None
2    H2G 1A7   +1 (514) 721-4711                None
3       0171     +47 22 44 22 22                None
4      14700    +420 2 4172 5555    +420 2 4172 5555

                      Email  SupportRepId
0      luisg@embraer.com.br             3
1     leonekohler@surfeu.de             5
2       ftremblay@gmail.com             3
3     bjorn.hansen@yahoo.no             4
4  frantisekw@jetbrains.com             4



employees

   EmployeeId LastName FirstName                Title  ReportsTo  \
0           1    Adams    Andrew      General Manager        NaN
1           2  Edwards     Nancy        Sales Manager        1.0
2           3  Peacock      Jane  Sales Support Agent        2.0
3           4     Park  Margaret  Sales Support Agent        2.0
4           5  Johnson     Steve  Sales Support Agent        2.0

             BirthDate             HireDate              Address      City  \
0  1962-02-18 00:00:00  2002-08-14 00:00:00  11120 Jasper Ave NW  Edmonton
1  1958-12-08 00:00:00  2002-05-01 00:00:00         825 8 Ave SW   Calgary
2  1973-08-29 00:00:00  2002-04-01 00:00:00        1111 6 Ave SW   Calgary
3  1947-09-19 00:00:00  2003-05-03 00:00:00     683 10 Street SW   Calgary
4  1965-03-03 00:00:00  2003-10-17 00:00:00         7727B 41 Ave   Calgary

  State Country PostalCode              Phone                Fax  \
0    AB  Canada    T5K 2N1  +1 (780) 428-9482  +1 (780) 428-3457
1    AB  Canada    T2P 2T3  +1 (403) 262-3443  +1 (403) 262-3322
2    AB  Canada    T2P 5M5  +1 (403) 262-3443  +1 (403) 262-6712
3    AB  Canada    T2P 5G3  +1 (403) 263-4423  +1 (403) 263-4289
4    AB  Canada    T3B 1Y7   1 (780) 836-9987   1 (780) 836-9543

                      Email
0    andrew@chinookcorp.com
1     nancy@chinookcorp.com
2      jane@chinookcorp.com
3  margaret@chinookcorp.com
4     steve@chinookcorp.com



genres

   GenreId                Name
0        1                Rock
1        2                Jazz
2        3               Metal
3        4  Alternative & Punk
4        5       Rock And Roll



invoices

   InvoiceId  CustomerId          InvoiceDate           BillingAddress  \
0          1           2  2009-01-01 00:00:00  Theodor-Heuss-Straße 34
1          2           4  2009-01-02 00:00:00         Ullevålsveien 14
2          3           8  2009-01-03 00:00:00          Grétrystraat 63
3          4          14  2009-01-06 00:00:00           8210 111 ST NW
4          5          23  2009-01-11 00:00:00          69 Salem Street

  BillingCity BillingState BillingCountry BillingPostalCode  Total
0   Stuttgart         None        Germany             70174   1.98
1        Oslo         None         Norway              0171   3.96
2    Brussels         None        Belgium              1000   5.94
3    Edmonton           AB         Canada           T6G 2C7   8.91
4      Boston           MA            USA              2113  13.86



invoice_items

   InvoiceLineId  InvoiceId  TrackId  UnitPrice  Quantity
0              1          1        2       0.99         1
1              2          1        4       0.99         1
2              3          2        6       0.99         1
3              4          2        8       0.99         1
4              5          2       10       0.99         1



media_types

   MediaTypeId                         Name
0            1              MPEG audio file
1            2     Protected AAC audio file
2            3  Protected MPEG-4 video file
3            4     Purchased AAC audio file
4            5               AAC audio file



playlists

   PlaylistId        Name
0           1       Music
1           2      Movies
2           3    TV Shows
3           4  Audiobooks
4           5  90’s Music



playlist_track

   PlaylistId  TrackId
0           1     3402
1           1     3389
2           1     3390
3           1     3391
4           1     3392



tracks

   TrackId                                     Name  AlbumId  MediaTypeId  \
0        1  For Those About To Rock (We Salute You)        1            1
1        2                        Balls to the Wall        2            2
2        3                          Fast As a Shark        3            2
3        4                        Restless and Wild        3            2
4        5                     Princess of the Dawn        3            2

   GenreId                                           Composer  Milliseconds  \
0        1          Angus Young, Malcolm Young, Brian Johnson        343719
1        1                                               None        342562
2        1  F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...        230619
3        1  F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...        252051
4        1                         Deaffy & R.A. Smith-Diesel        375418

      Bytes  UnitPrice
0  11170334       0.99
1   5510424       0.99
2   3990994       0.99
3   4331779       0.99
4   6290521       0.99



sqlite_stat1

              tbl                                idx        stat
0          tracks               IFK_TrackMediaTypeId    3503 701
1          tracks                   IFK_TrackGenreId    3503 141
2          tracks                   IFK_TrackAlbumId     3503 11
3  playlist_track           IFK_PlaylistTrackTrackId      8715 3
4  playlist_track  sqlite_autoindex_playlist_track_1  8715 623 1

In [6]:
sqlite_query = """
SELECT COUNT(DISTINCT(AlbumID)) as '#Distinct Albums', COUNT(DISTINCT(ArtistId)) as '#Disinct Artists' FROM albums;
"""
pd.read_sql(sqlite_query, conn)

   #Distinct Albums  #Disinct Artists
0               347               204

204 artists produce 347 albums

In [34]:
sqlite_query = """
SELECT * FROM sqlite_sequence;"""
pd.read_sql(sqlite_query, conn)

            name   seq
0         genres    25
1    media_types     5
2        artists   275
3         albums   347
4         tracks  3503
5      employees     8
6      customers    59
7       invoices   412
8  invoice_items  2240
9      playlists    18

From inspection this appears to give the number of the different genres, media_types, artists, ... in the database.

In [33]:
sqlite_query = """
SELECT Name as "artist_name", COUNT(*) as "number_of_albums"
FROM albums 
INNER JOIN artists
ON artists.ArtistId = albums.ArtistId
GROUP BY albums.ArtistID
ORDER BY number_of_albums DESC
LIMIT 10;
"""
pd.read_sql(sqlite_query, conn)

       artist_name  number_of_albums
0      Iron Maiden                21
1     Led Zeppelin                14
2      Deep Purple                11
3        Metallica                10
4               U2                10
5    Ozzy Osbourne                 6
6        Pearl Jam                 5
7  Various Artists                 4
8    Faith No More                 4
9     Foo Fighters                 4

## Toy exercises

### What is the most popular genre in the US and Canada?

In [32]:
#seeing if any of the tracks in the invoice_items were ordered in a quantity of more than one
sql_query = """ 
SELECT quantity, COUNT(*)
FROM invoice_items 
GROUP BY quantity;
"""
pd.read_sql(sql_query, conn)

   Quantity  COUNT(*)
0         1      2240

In [31]:
#how many orders are from people in the USA or Canada
sql_query = """
SELECT COUNT(*) as "number_of_orders"
FROM invoices
INNER JOIN customers
ON customers.CustomerId = invoices.CustomerId
WHERE customers.country = "USA" or customers.country = "Canada";
"""
pd.read_sql(sql_query, conn)

   number_of_orders
0               147

Note these orders can consist of multiple tracks

In [30]:
sql_query = """ 
SELECT genres.name, count(*) as "genre_frequency"
FROM invoice_items
INNER JOIN tracks
ON tracks.TrackId = invoice_items.TrackId
INNER JOIN genres 
ON genres.GenreId = tracks.GenreId
INNER JOIN invoices
ON invoices.InvoiceId = invoice_items.InvoiceId
INNER JOIN customers 
ON customers.customerId = invoices.customerId
WHERE customers.country =  "USA" OR customers.country = "Canada"
GROUP BY genres.name
ORDER BY genre_frequency DESC
LIMIT 10;
"""
print("USA or CANADA")
pd.read_sql(sql_query, conn)

USA or CANADA

                 Name  genre_frequency
0                Rock              264
1               Latin              151
2               Metal              104
3  Alternative & Punk               86
4                Jazz               35
5               Blues               19
6            R&B/Soul               17
7            TV Shows               15
8          Bossa Nova               14
9           Classical               13

Rock appears to be the most popular genre in the USA and Canada within the dataset.

In [29]:
#overall frequency
sql_query = """ 
SELECT genres.name, count(*) as "genre_frequency"
FROM invoice_items
INNER JOIN tracks
ON tracks.TrackId = invoice_items.TrackId
INNER JOIN genres 
ON genres.GenreId = tracks.GenreId
INNER JOIN invoices
ON invoices.InvoiceId = invoice_items.InvoiceId
INNER JOIN customers 
ON customers.customerId = invoices.customerId
GROUP BY genres.name
ORDER BY genre_frequency DESC
LIMIT 10;
"""

pd.read_sql(sql_query, conn)

                 Name  genre_frequency
0                Rock              835
1               Latin              386
2               Metal              264
3  Alternative & Punk              244
4                Jazz               80
5               Blues               61
6            TV Shows               47
7           Classical               41
8            R&B/Soul               41
9              Reggae               30

### Who is the top selling artist of 2012?

In [28]:
sql_query = """
SELECT artists.name, count(*) as "freq", strftime('%Y', InvoiceDate) as "year" FROM invoices
INNER JOIN invoice_items
ON invoice_items.invoiceid = invoices.invoiceid
INNER JOIN tracks
ON invoice_items.trackid = tracks.trackid
INNER JOIN albums
ON albums.albumid = tracks.albumid
INNER JOIN artists
ON artists.artistid = albums.artistid
WHERE year = '2012'
GROUP BY (artists.name)
ORDER BY freq DESC
LIMIT 1;
"""
pd.read_sql(sql_query, conn)

          Name  freq  year
0  Iron Maiden    34  2012

### Which customer spent the most overall in the data?

In [27]:
sql_query = """
SELECT invoices.customerid, customers.firstname || ' ' || customers.lastname as "customer_name", SUM(invoice_items.unitprice * invoice_items.quantity) as "amount_spent" 
FROM invoice_items 
INNER JOIN invoices
ON invoice_items.invoiceid = invoices.invoiceid
INNER JOIN customers
ON customers.customerid = invoices.customerid
GROUP BY invoices.customerid
ORDER BY amount_spent DESC
LIMIT 1;
"""
pd.read_sql(sql_query, conn)

   CustomerId customer_name  amount_spent
0           6   Helena Holý         49.62

### How many customers spent over £40?

In [26]:
sql_query = """
SELECT COUNT(*) FROM
(SELECT invoices.customerid, SUM(invoice_items.unitprice * invoice_items.quantity) as "amount_spent" 
FROM invoice_items 
INNER JOIN invoices
ON invoice_items.invoiceid = invoices.invoiceid
INNER JOIN customers
ON customers.customerid = invoices.customerid
GROUP BY invoices.customerid)
WHERE amount_spent >= 40;
"""
pd.read_sql(sql_query, conn)

   COUNT(*)
0        14

### What is the percentage change between the amount spent on sales of tracks between 2012 and 2011?

In [25]:
sql_query = """
SELECT strftime('%Y', invoicedate) as "year", SUM(total) FROM invoices
GROUP BY year;"""
pd.read_sql(sql_query, conn)

   year  SUM(total)
0  2009      449.46
1  2010      481.45
2  2011      469.58
3  2012      477.53
4  2013      450.58

In [17]:
percentage_increase = (477.53/469.58 - 1 )*100.0
print('There is a percentage increase between 2011 and 2012 of {}%.'.format(round(percentage_increase,2)))

There is a percentage increase between 2011 and 2012 of 1.69%.

### How many customers have gmail accounts?

In [49]:
sql_query = """
SELECT COUNT(email) as "#gmail_acounts" FROM customers 
WHERE email LIKE '%gmail%';
"""
pd.read_sql(sql_query, conn)

   #gmail_acounts
0               8

### Show a frequency table of the different roles of employees as a percentage of the overall number of employees

In [94]:
sql_query = """ 
SELECT COUNT(*) 
FROM employees
"""
pd.read_sql(sql_query, conn)

   COUNT(*)
0         8

In [99]:
sql_query = """
SELECT title, (COUNT(*)/8.0 *100) as "percentage"
FROM employees
GROUP BY title;
"""
pd.read_sql(sql_query, conn)

                 Title  percentage
0      General Manager        12.5
1           IT Manager        12.5
2             IT Staff        25.0
3        Sales Manager        12.5
4  Sales Support Agent        37.5

In [100]:
conn.close()